app/views/menuitems/_form.html.erb


      <% Vendor.all.each do |vendor| %>
        <%= check_box_tag "menuitem[vendor_ids][]", vendor.id, @menuitem.vendors.include?(vendor), :style => "float:left;" %>
---
SELECT "vendors".* FROM "vendors"
SELECT 1 AS one FROM "vendors" INNER JOIN "menuitems_vendors" ON "vendors"."id" = "menuitems_vendors"."vendor_id" WHERE "menuitems_vendors"."menuitem_id" IS NULL AND "vendors"."id" = 4 LIMIT 1