app/views/menuitems/show.html.erb

SELECT "vendors".* FROM "vendors" INNER JOIN "menuitems_vendors" ON "vendors"."id" = "menuitems_vendors"."vendor_id" WHERE "menuitems_vendors"."menuitem_id" = 1
---
          <ul>
            <% @menuitem.vendors.each do |vendor| %>