app/views/vendors/_averagerating.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."vendor_id" = 3
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."vendor_id" = 3
---
<% unless @vendor.reviews.empty? %>