app/views/vendors/_form.html.erb

SELECT "menuitems".* FROM "menuitems"
SELECT 1 AS one FROM "menuitems" INNER JOIN "menuitems_vendors" ON "menuitems"."id" = "menuitems_vendors"."menuitem_id" WHERE "menuitems_vendors"."vendor_id" IS NULL AND "menuitems"."id" = 1 LIMIT 1
---

  <% Menuitem.all.each do |menuitem| %>
    <%= check_box_tag "vendor[menuitem_ids][]", menuitem.id, @vendor.menuitems.include?(menuitem), :style => "float:left;" %>