app/controllers/menuitems_controller.rb

  def index
    @menuitems = Menuitem.all
---
SELECT "menuitems".* FROM "menuitems"

  def show
    @menuitem = Menuitem.find(params[:id])
---
SELECT "menuitems".* FROM "menuitems" WHERE "menuitems"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    menuitem = Menuitem.new(params[:menuitem])
    menuitem.save
    redirect_to menuitem.vendors.first
---
INSERT INTO "menuitems" ("created_at", "description", "image", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 16 Jul 2013 00:50:08 UTC +00:00], ["description", nil], ["image", nil], ["name", "Tacos"], ["price", nil], ["updated_at", Tue, 16 Jul 2013 00:50:08 UTC +00:00]]
SELECT "vendors".* FROM "vendors" INNER JOIN "menuitems_vendors" ON "vendors"."id" = "menuitems_vendors"."vendor_id" WHERE "menuitems_vendors"."menuitem_id" = 10

  def edit
    @menuitem = Menuitem.find(params[:id])
---
SELECT "menuitems".* FROM "menuitems" WHERE "menuitems"."id" = ? LIMIT 1  [["id", "5"]]

  def update
    @menuitem = Menuitem.find(params[:id])
    @menuitem.update_attributes(params[:menuitem])
---
SELECT "menuitems".* FROM "menuitems" WHERE "menuitems"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "menuitems" SET "name" = 'Falafel wraps', "description" = '', "image" = '', "updated_at" = '2013-07-16 19:24:17.848515' WHERE "menuitems"."id" = 1

  def destroy
    Menuitem.find(params[:id]).destroy
---
DELETE FROM "menuitems" WHERE "menuitems"."id" = ?  [["id", 9]]
SELECT "menuitems".* FROM "menuitems" WHERE "menuitems"."id" = ? LIMIT 1  [["id", "9"]]