app/controllers/reviews_controller.rb

  def create
    if @current_user
      review = Review.new(params[:review])
      review.save
---
INSERT INTO "reviews" ("created_at", "rating", "text", "updated_at", "user_id", "vendor_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 16 Jul 2013 02:39:22 UTC +00:00], ["rating", 2], ["text", "Oranges were bad"], ["updated_at", Tue, 16 Jul 2013 02:39:22 UTC +00:00], ["user_id", nil], ["vendor_id", nil]]

  def update
    if @current_user && @current_user.is_admin
    @review = Review.find(params[:id])
    @review.update_attributes(params[:review])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "reviews" SET "rating" = 3, "updated_at" = '2013-07-16 20:14:19.309580' WHERE "reviews"."id" = 7