app/controllers/vendors_controller.rb

  def index
    if params[:search].present?
      @vendors = Vendor.near(params[:search], 5, :order => :distance)
      expires_in 3.minutes, public: true
      # NUMBER IS IN MILES
    else
      @vendors = Vendor.all
---
SELECT vendors.*, (69.09332411348201 * ABS(vendors.latitude - 40.7602619) * 0.7071067811865475) + (59.836573914187355 * ABS(vendors.longitude - -73.9932872) * 0.7071067811865475) AS distance, CASE WHEN (vendors.latitude >= 40.7602619 AND vendors.longitude >= -73.9932872) THEN 45.0 WHEN (vendors.latitude < 40.7602619 AND vendors.longitude >= -73.9932872) THEN 135.0 WHEN (vendors.latitude < 40.7602619 AND vendors.longitude < -73.9932872) THEN 225.0 WHEN (vendors.latitude >= 40.7602619 AND vendors.longitude < -73.9932872) THEN 315.0 END AS bearing FROM "vendors" WHERE (vendors.latitude BETWEEN 40.036602984445764 AND 41.48392081555424 AND vendors.longitude BETWEEN -74.9486780094804 AND -73.03789639051959) ORDER BY distance

  def show
    @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    vendor = Vendor.new(params[:vendor])
    vendor.save
---
INSERT INTO "vendors" ("address", "created_at", "gmaps", "hours", "latitude", "longitude", "name", "phone", "twitter", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @vendor = Vendor.find(params[:id])
    @vendor.update_attributes(params[:vendor])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "vendors" SET "name" = 'Columbia', "address" = '10027', "hours" = '', "phone" = '', "twitter" = '', "longitude" = -73.96243270000001, "latitude" = 40.8138912, "updated_at" = '2013-07-15 21:18:23.101225' WHERE "vendors"."id" = 6

  def destroy
    Vendor.find(params[:id]).destroy
---
DELETE FROM "vendors" WHERE "vendors"."id" = ?  [["id", 6]]
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "6"]]