app/views/reviews/_form.html.erb

        <%= f.label "Which vendor?" %>
        <%= f.collection_select :vendor_id, Vendor.all, :id, :name %><br>
---
SELECT "vendors".* FROM "vendors"